# StairsAttrBreakSymInCutline Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsAttrBreakSymInCutline Property
ParameterTypeId Class See Also
---
"Break Symbol in Plan"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsAttrBreakSymInCutline { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsAttrBreakSymInCutline As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsAttrBreakSymInCutline {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace